m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/system/src/clock/MKV58F22/fsl_clock_MKV58F22.h
/*!
 * @brief Disable the clock for CRC module.
 *
 * This function disables the clock for CRC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableCrcClock(uint32_t instance)
{
    SIM_HAL_DisableCrcClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for CRC module.
 *
 * This function will get the clock gate state for CRC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetCrcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetCrcGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for ADC module.
 *
 * This function enables the clock for ADC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableAdcClock(uint32_t instance)
{
    SIM_HAL_EnableAdcClock(SIM, instance);
}

/*!
 * @brief Disable the clock for ADC module.
 *
 * This function disables the clock for ADC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableAdcClock(uint32_t instance)
{
    SIM_HAL_DisableAdcClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for ADC module.
 *
 * This function will get the clock gate state for ADC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetAdcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetAdcGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for HSADC module.
 *
 * This function enables the clock for HSADC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableHsadcClock(uint32_t instance)
{
    SIM_HAL_EnableHsadcClock(SIM, instance);
}

/*!
 * @brief Disable the clock for HSADC module.
 *
 * This function disables the clock for HSADC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableHsadcClock(uint32_t instance)
{
    SIM_HAL_DisableHsadcClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for HSADC module.
 *
 * This function will get the clock gate state for HSADC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetHsadcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetHsadcGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for CMP module.
 *
 * This function enables the clock for CMP module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableCmpClock(uint32_t instance)
{
    SIM_HAL_EnableCmpClock(SIM, instance);
}

/*!
 * @brief Disable the clock for CMP module.
 *
 * This function disables the clock for CMP module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableCmpClock(uint32_t instance)
{
    SIM_HAL_DisableCmpClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for CMP module.
 *
 * This function will get the clock gate state for CMP module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetCmpGateCmd(uint32_t instance)
{
    return SIM_HAL_GetCmpGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for DAC module.
 *
 * This function enables the clock for DAC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableDacClock(uint32_t instance)
{
    SIM_HAL_EnableDacClock(SIM, instance);
}

/*!
 * @brief Disable the clock for DAC module.
 *
 * This function disables the clock for DAC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableDacClock(uint32_t instance)
{
    SIM_HAL_DisableDacClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for DAC module.
 *
 * This function will get the clock gate state for DAC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetDacGateCmd(uint32_t instance)
{
    return SIM_HAL_GetDacGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for PDB module.
 *
 * This function enables the clock for PDB module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnablePdbClock(uint32_t instance)
{
    SIM_HAL_EnablePdbClock(SIM, instance);
}

/*!
 * @brief Disable the clock for PDB module.
 *
 * This function disables the clock for PDB module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisablePdbClock(uint32_t instance)
{
    SIM_HAL_DisablePdbClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for PDB module.
 *
 * This function will get the clock gate state for PDB module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetPdbGateCmd(uint32_t instance)
{
    return SIM_HAL_GetPdbGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for FTM module.
 *
 * This function enables the clock for FTM module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableFtmClock(uint32_t instance)
{
    SIM_HAL_EnableFtmClock(SIM, instance);
}

/*!
 * @brief Disable the clock for FTM module.
 *
 * This function disables the clock for FTM module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableFtmClock(uint32_t instance)
{
    SIM_HAL_DisableFtmClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for FTM module.
 *
 * This function will get the clock gate state for FTM module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetFtmGateCmd(uint32_t instance)
{
    return SIM_HAL_GetFtmGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for PIT module.
 *
 * This function enables the clock for PIT module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnablePitClock(uint32_t instance)
{
    SIM_HAL_EnablePitClock(SIM, instance);
}

/*!
 * @brief Disable the clock for PIT module.
 *
 * This function disables the clock for PIT module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisablePitClock(uint32_t instance)
{
    SIM_HAL_DisablePitClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for PIT module.
 *
 * This function will get the clock gate state for PIT module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetPitGateCmd(uint32_t instance)
{
    return SIM_HAL_GetPitGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for LPTIMER module.
 *
 * This function enables the clock for LPTIMER module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableLptmrClock(uint32_t instance)
{
    SIM_HAL_EnableLptmrClock(SIM, instance);
}

/*!
 * @brief Disable the clock for LPTIMER module.
 *
 * This function disables the clock for LPTIMER module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableLptmrClock(uint32_t instance)
{
    SIM_HAL_DisableLptmrClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for LPTIMER module.
 *
 * This function will get the clock gate state for LPTIMER module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetLptmrGateCmd(uint32_t instance)
{
    return SIM_HAL_GetLptmrGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for ENET module.
 *
 * This function enables the clock for ENET module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableEnetClock(uint32_t instance)
{
    SIM_HAL_EnableEnetClock(SIM, instance);
}

/*!
 * @brief Disable the clock for ENET module.
 *
 * This function disables the clock for ENET module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableEnetClock(uint32_t instance)
{
    SIM_HAL_DisableEnetClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for ENET module.
 *
 * This function will get the clock gate state for ENET module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetEnetGateCmd(uint32_t instance)
{
    return SIM_HAL_GetEnetGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for FLEXCAN module.
 *
 * This function enables the clock for FLEXCAN module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableFlexcanClock(uint32_t instance)
{
    SIM_HAL_EnableFlexcanClock(SIM, instance);
}

/*!
 * @brief Disable the clock for FLEXCAN module.
 *
 * This function disables the clock for FLEXCAN module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableFlexcanClock(uint32_t instance)
{
    SIM_HAL_DisableFlexcanClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for FLEXCAN module.
 *
 * This function will get the clock gate state for FLEXCAN module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetFlexcanGateCmd(uint32_t instance)
{
    return SIM_HAL_GetFlexcanGateCmd(SIM, instance);
}

 /*!
 * @brief Gets FLEXCAN clock frequency.
 *
 * This function gets the FLEXCAN clock frequency.
 *
 * @param instance   module device instance
 * @param flexcanSrc clock source
 * @return Current frequency.
 */
uint32_t CLOCK_SYS_GetFlexcanFreq(uint8_t instance, clock_flexcan_src_t flexcanSrc);

#if FSL_FEATURE_SOC_ENET_COUNT
/*!
 * @brief Set the ethernet timestamp clock source selection.
 *
 * This function sets the ethernet timestamp clock source selection.
 *
 * @param instance module device instance.
 * @param timeSrc  Ethernet timestamp clock source.
 */
static inline void CLOCK_SYS_SetEnetTimeStampSrc(uint32_t instance, clock_time_src_t timeSrc)
{
    CLOCK_HAL_SetTimeSrc(SIM, instance, timeSrc);
}

/*!
 * @brief Get the ethernet timestamp clock source selection.
 *
 * This function gets the ethernet timestamp clock source selection.
 *
 * @param instance IP instance.
 *
 * @return Current source.
 */
static inline clock_time_src_t CLOCK_SYS_GetEnetTimeStampSrc(uint32_t instance)
{
    return CLOCK_HAL_GetTimeSrc(SIM, instance);
}
#endif

/*!
 * @brief Enable the clock for SPI module.
 *
 * This function enables the clock for SPI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableSpiClock(uint32_t instance)
{
    SIM_HAL_EnableSpiClock(SIM, instance);
}

/*!
 * @brief Disable the clock for SPI module.
 *
 * This function disables the clock for SPI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableSpiClock(uint32_t instance)
{
    SIM_HAL_DisableSpiClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for SPI module.
 *
 * This function will get the clock gate state for SPI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetSpiGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for I2C module.
 *
 * This function enables the clock for I2C module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableI2cClock(uint32_t instance)
{
    SIM_HAL_EnableI2cClock(SIM, instance);
}

/*!
 * @brief Disable the clock for I2C module.
 *
 * This function disables the clock for I2C module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableI2cClock(uint32_t instance)
{
    SIM_HAL_DisableI2cClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for I2C module.
 *
 * This function will get the clock gate state for I2C module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
    return SIM_HAL_GetI2cGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for UART module.
 *
 * This function enables the clock for UART module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableUartClock(uint32_t instance)
{
    SIM_HAL_EnableUartClock(SIM, instance);
}

/*!
 * @brief Disable the clock for UART module.
 *
 * This function disables the clock for UART module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableUartClock(uint32_t instance)
{
    SIM_HAL_DisableUartClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for UART module.
 *
 * This function will get the clock gate state for UART module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetUartGateCmd(uint32_t instance)
{
    return SIM_HAL_GetUartGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for eFlexPWM module.
 *
 * This function enables the clock for eFlexPWM module.
 * @param instance module device instance
 * @param channel PWM module channel
 */
static inline void CLOCK_SYS_EnablePwmClock(uint32_t instance, uint8_t channel)
{
    SIM_HAL_EnablePwmClock(SIM, instance, channel);
}

/*!
 * @brief Disable the clock for eFlexPWM module.
 *
 * This function disables the clock for eFlexPWM module.
 * @param instance module device instance
 * @param channel PWM module channel
 */
static inline void CLOCK_SYS_DisablePwmClock(uint32_t instance, uint8_t channel)
{
    SIM_HAL_DisablePwmClock(SIM, instance, channel);
}

/*!
 * @brief Get the the clock gate state for eFlexPWM module.
 *
 * This function will get the clock gate state for eFlexPWM module.
 * @param instance module device instance
 * @param channel PWM module channel
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetPwmGateCmd(uint32_t instance, uint8_t channel)
{
    return SIM_HAL_GetPwmGateCmd(SIM, instance, channel);
}

/*!
 * @brief Enable the clock for AOI module.
 *
 * This function enables the clock for AOI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableAoiClock(uint32_t instance)
{
    SIM_HAL_EnableAoiClock(SIM, instance);
}

/*!
 * @brief Disable the clock for AOI module.
 *
 * This function disables the clock for AOI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableAoiClock(uint32_t instance)
{
    SIM_HAL_DisableAoiClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for AOI module.
 *
 * This function will get the clock gate state for AOI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetAoiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetAoiGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for XBAR module.
 *
 * This function enables the clock for XBAR module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableXbarClock(uint32_t instance)
{
    SIM_HAL_EnableXbarClock(SIM, instance);
}

/*!
 * @brief Disable the clock for XBAR module.
 *
 * This function disables the clock for XBAR module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableXbarClock(uint32_t instance)
{
    SIM_HAL_DisableXbarClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for XBAR module.
 *
 * This function will get the clock gate state for XBAR module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetXbarGateCmd(uint32_t instance)
{
    return SIM_HAL_GetXbarGateCmd(SIM, instance);
}

/*!
 * @brief Enable the clock for ENC module.
 *
 * This function enables the clock for ENC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableEncClock(uint32_t instance)
{
    SIM_HAL_EnableEncClock(SIM, instance);
}

/*!
 * @brief Disable the clock for ENC module.
 *
 * This function disables the clock for ENC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableEncClock(uint32_t instance)
{
    SIM_HAL_DisableEncClock(SIM, instance);
}

/*!
 * @brief Get the the clock gate state for ENC module.
 *
 * This function will get the clock gate state for ENC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetEncGateCmd(uint32_t instance)
{
    return SIM_HAL_GetEncGateCmd(SIM, instance);
}

/*!
 * @brief Set the ENET external clock frequency(ENET_1588_CLKIN).
 *
 * This function sets the ENET external clock frequency (ENET_1588_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequcney value.
 */
static inline void CLOCK_SYS_SetEnetExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < ENET_EXT_CLK_COUNT);

    g_enet1588ClkInFreq[srcInstance] = freq;
}

/*!
* @brief Enable the clock for TRNG module.
*
* This function enables the clock for TRNG module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_EnableTrngClock(uint32_t instance)
{
    SIM_HAL_EnableTrngClock(SIM, instance);
}

/*!
* @brief Disable the clock for TRNG module.
*
* This function disables the clock for TRNG module.
* @param instance module device instance
*/
static inline void CLOCK_SYS_DisableTrngClock(uint32_t instance)
{
    SIM_HAL_DisableTrngClock(SIM, instance);
}

/*!
* @brief Get the the clock gate state for TRNG module.
*
* This function will get the clock gate state for TRNG module.
* @param instance module device instance
* @return state true - ungated(Enabled), false - gated (Disabled)
*/
static inline bool CLOCK_SYS_GetTrngGateCmd(uint32_t instance)
{
    return SIM_HAL_GetTrngGateCmd(SIM, instance);
}



#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_CLOCK_KV58F22_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

